<a href="https://colab.research.google.com/github/ONowakowski/howToDataInPython/blob/master/pandas_how_to.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np

#Series

In [ ]:
s = pd.Series(data=[4,3,2,1]) #z obiekt√≥w Series sklada sie dataFrame
s

0    4
1    3
2    2
3    1
dtype: int64

In [ ]:
s = pd.Series(data=np.arange(10, 20), index=pd.date_range(start="20201001", periods=10)) #index jako daty
s

2020-10-01    10
2020-10-02    11
2020-10-03    12
2020-10-04    13
2020-10-05    14
2020-10-06    15
2020-10-07    16
2020-10-08    17
2020-10-09    18
2020-10-10    19
Freq: D, dtype: int64

In [ ]:
list(s.index)

[Timestamp('2020-10-01 00:00:00', freq='D'),
 Timestamp('2020-10-02 00:00:00', freq='D'),
 Timestamp('2020-10-03 00:00:00', freq='D'),
 Timestamp('2020-10-04 00:00:00', freq='D'),
 Timestamp('2020-10-05 00:00:00', freq='D'),
 Timestamp('2020-10-06 00:00:00', freq='D'),
 Timestamp('2020-10-07 00:00:00', freq='D'),
 Timestamp('2020-10-08 00:00:00', freq='D'),
 Timestamp('2020-10-09 00:00:00', freq='D'),
 Timestamp('2020-10-10 00:00:00', freq='D')]

In [ ]:
s = pd.Series(data=['Hej', 'Czesc', 'Witam'], name="greetings")
s

0      Hej
1    Czesc
2    Witam
Name: greetings, dtype: object

In [ ]:
s.shape

(3,)

In [ ]:
score = pd.Series(data={'Polska':10, 'Niemcy': 20, 'Holandia':5, 'Bialorus':np.nan}) #tworzymy indexy wraz z wartosciami
score

Polska      10.0
Niemcy      20.0
Holandia     5.0
Bialorus     NaN
dtype: float64

In [ ]:
score['Polska'] #pobieranie wartosci na podstawie indexu

10

In [ ]:
score[2] #Wynik Holandii

5

In [ ]:
score.count() #liczy wiersze, nie wlicza wartosci NaN

3

In [ ]:
score.value_counts() #pokazuje ile razy wystapila dana wartosc, przydatne do histogramow. Nie dostaniemy NaN

10    1
5     1
20    1
dtype: int64

In [ ]:
score.value_counts(dropna=False) #liczymy NaN

NaN     1
5.0     1
20.0    1
10.0    1
dtype: int64

In [ ]:
score.sum()

35

In [ ]:
score.min()

5

In [ ]:
score.max()

20

In [ ]:
score.std()

7.637626158259733

In [ ]:
score.describe() #dostaniemy liczbe wierszy, srednia, odchylenie, kwantyle, max, min

count     3.000000
mean     11.666667
std       7.637626
min       5.000000
25%       7.500000
50%      10.000000
75%      15.000000
max      20.000000
dtype: float64

In [ ]:
score.nlargest(2) #dwie najwieksze wartosci

Niemcy    20.0
Polska    10.0
dtype: float64

In [ ]:
score.nsmallest(2) #dwie najmniejsze wartosci, nie liczy NaN

Holandia     5.0
Polska      10.0
dtype: float64

In [ ]:
score.rank() #przypisuje pozycje, najmniejsza jest pierwsza, najwieksza ostatnia

Polska      2.0
Niemcy      3.0
Holandia    1.0
Bialorus    NaN
dtype: float64

In [ ]:
score.sort_values()

Holandia     5.0
Polska      10.0
Niemcy      20.0
Bialorus     NaN
dtype: float64

In [ ]:
score.sort_values(ascending=False)

Niemcy      20.0
Polska      10.0
Holandia     5.0
Bialorus     NaN
dtype: float64

In [ ]:
score_table = score.apply(lambda x: x*3) #czyli mnozymy wszystkie wartosci przez 3, pierwotny obiekt nie ulega zmianie
score_table

Polska      30.0
Niemcy      60.0
Holandia    15.0
Bialorus     NaN
dtype: float64

#DataFrame

In [ ]:
df = pd.DataFrame(data=[43, 21, 55, 22], index=['First', 'Second', 'Third', 'Fourth'], columns=['Column_1'])
df

        Column_1
First         43
Second        21
Third         55
Fourth        22

In [ ]:
people = pd.DataFrame(data={'Wiek':[12, 40, 22, 17], 
                        'Imie': ['Oskar', 'Justyna', 'Grzegorz', 'Piotr'],
                        'Mezczyzna': [True, False, True, True]})
people

   Wiek      Imie  Mezczyzna
0    12     Oskar       True
1    40   Justyna      False
2    22  Grzegorz       True
3    17     Piotr       True

In [ ]:
names = ['Oskar', 'Justyna', 'Grzegorz', 'Piotr']
how_old = [12, 40, np.nan, 17]
man = [True, False, True, True]

people_2 = pd.DataFrame(data = {'Imie': names, 'Wiek': how_old, 'Mezczyzna': man}, index=np.arange(1,5))
people_2

       Imie  Wiek  Mezczyzna
1     Oskar  12.0       True
2   Justyna  40.0      False
3  Grzegorz   NaN       True
4     Piotr  17.0       True

In [ ]:
people_2.columns

Index(['Imie', 'Wiek', 'Mezczyzna'], dtype='object')

In [ ]:
people_2.values

array([['Oskar', 12.0, True],
       ['Justyna', 40.0, False],
       ['Grzegorz', nan, True],
       ['Piotr', 17.0, True]], dtype=object)

In [ ]:
people_2.index

Int64Index([1, 2, 3, 4], dtype='int64')

In [ ]:
people_2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 1 to 4
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Imie       4 non-null      object
 1   Wiek       3 non-null      float64
 2   Mezczyzna  4 non-null      bool
dtypes: bool(1), float64(1), object(1)
memory usage: 100.0+ bytes

In [ ]:
people_2.describe()

            Wiek
count   3.000000
mean   23.000000
std    14.933185
min    12.000000
25%    14.500000
50%    17.000000
75%    28.500000
max    40.000000

In [ ]:
people_2.count()

Imie         4
Wiek         3
Mezczyzna    4
dtype: int64

In [ ]:
df = pd.DataFrame(data=[[23, 22, 11], [23, 44, 15]], columns=['col1', 'col2', 'col3'])
df

   col1  col2  col3
0    23    22    11
1    23    44    15

In [ ]:
df.describe().T #transponujemy tabele describe zeby kolumny byly w wierszach

      count  mean        std   min   25%   50%   75%   max
col1    2.0  23.0   0.000000  23.0  23.0  23.0  23.0  23.0
col2    2.0  33.0  15.556349  22.0  27.5  33.0  38.5  44.0
col3    2.0  13.0   2.828427  11.0  12.0  13.0  14.0  15.0

Selekcja kolumn

In [ ]:
 df['col1'] #dostaniemy kolumne pierwsza w obiekcie typu Series

0    23
1    23
Name: col1, dtype: int64

In [ ]:
df[['col1']] #dostaniemy kolumne w obiekcie typu DataFrame

   col1
0    23
1    23

In [ ]:
df.columns = ['a','b','c'] #zmiana nazw kolumn
df

    a   b   c
0  23  22  11
1  23  44  15

In [ ]:
df.columns[0] #pobranie nazwy pierwszej kolumny

'a'

In [ ]:
df.c #pobranie kolumny z nazwa c

0    11
1    15
Name: c, dtype: int64

In [ ]:
df['d'] = df.a + df.b #tworzenie nowej kolumny 
df

    a   b   c   d
0  23  22  11  45
1  23  44  15  67

In [ ]:
df = pd.DataFrame(data=[[12, 23, 10], [50, 20, 11]], index=['First', 'Second'], columns=['col1', 'col2', 'col3'])
df

        col1  col2  col3
First     12    23    10
Second    50    20    11

In [ ]:
df.loc['Second'] #wyswietla drugi wiersz, czyli loc szuka po nazwie indeksu

col1    50
col2    20
col3    11
Name: Second, dtype: int64

In [ ]:
df.loc[:, 'col2'] #wszystkie wiersze col2

First     23
Second    20
Name: col2, dtype: int64

In [ ]:
df.loc['First', 'col3'] #wiersz pierwszy, col3

10

In [ ]:
df.iloc[1] #rowniez wyswietla drugi wiersz, po numerze

col1    50
col2    20
col3    11
Name: Second, dtype: int64

In [ ]:
df.iloc[0:2] #wyswietla od pierwszego do drugiego wiersza

        col1  col2  col3
First     12    23    10
Second    50    20    11

In [ ]:
df.iloc[:, 2] #oba wiersze z trzeciej kolumny

First     10
Second    11
Name: col3, dtype: int64

In [ ]:
df.iloc[1, :] #pierwszy wiersz, wszystkie kolumny

col1    50
col2    20
col3    11
Name: Second, dtype: int64